---
kind: type
id: T:Autodesk.Revit.DB.Electrical.WireSet
source: html/44035985-f6a1-72de-ae57-ac08507c8bbb.htm
---
# Autodesk.Revit.DB.Electrical.WireSet

A set that can contain any type of object.

## Syntax (C#)
```csharp
public class WireSet : APIObject, IEnumerable
```